import PriceAndEnroll from "@/components/Course/CoursePageLeftUI/PriceAndEnroll/PriceAndEnroll";

export const coursePageData = {
  id: 1,
  title: "HSC ২5 অনলাইন ব্যাচ (ফিজিক্স, কেমিস্ট্রি, ম্যাথ, বায়োলজি)",
  price: 4700,
  tags: ["HSC", "ফিজিক্স", "কেমিস্ট্রি", "ম্যাথ", "বায়োলজি"],
  description:
    "এসএসসি’র থেকে দ্বিগুনেরও বেশি অধ্যায় নিয়ে তৈরি এইচএসসি পরীক্ষার সিলেবাস। এইচএসসি পরীক্ষায় কাঙ্খিত ভাল ফলাফল অর্জণ করতে ১ম এবং ২য় পত্র দুটিতেই দরকার সমান প্রস্ততি। উভয় পত্রে নিজের দখলই প্রমাণ করবে তোমার একশোতে একশো প্রস্ততি। সঠিক পরিকল্পনা আর কার্যকরী রুটিনের সাথে চমৎকার ইন্টারেক্টিভ লাইভ ক্লাসের মাধ্যমে উভয় পত্রের প্রিপারেশন নিয়ে নাও টেন মিনিট স্কুলের HSC ২0২5 অনলাইন ব্যাচের সাথে।",
  mediaLinks: [
    {
      id: 1,
      type: "video",
      video_link: "https://www.youtube.com/embed/SMKPKGW083c",
    },
    {
      id: 2,
      type: "image",
      image_link:
        "https://img.freepik.com/free-photo/learners-lesson_1098-13569.jpg?w=740&t=st=1687২65540~exp=1687২66140~hmac=২0২4d683d1300২f3e68২0২4fe15c593446b0b২4174f0২681ce78ebff4b05২২২d",
    },
  ],
  classRoutine: {
    title: "ক্লাস রুটিন",
    routine: [
      {
        day: "শনিবার",
        number_of_class: 2,
      },
      {
        day: "রবিবার",
        number_of_class: 2,
      },
      {
        day: "সোমবার",
        number_of_class: 2,
      },
      {
        day: "মঙ্গলবার",
        number_of_class: 2,
      },
      {
        day: "বুধবার",
        number_of_class: 2,
      },
      {
        day: "বৃহস্পতিবার",
        number_of_class: 2,
      },
    ],
  },
  course_price: 4500,
};

export const coursePageStaticData = {
  button1: "বুকিং করো এখনই",
  class_requirements: {
    title: "ক্লাস করার জন্য প্রয়োজন হবে",
    lists: [
      {
        id: 1,
        title: "ইন্টারনেট সংযোগ (ওয়াইফাই বা মোবাইল ইন্টারনেট)",
      },
      {
        id: 2,
        title: "স্মার্টফোন অথবা পিসি",
      },
    ],
  },
};

export const relatedCoursesData = [
  {
    id: 1,
    title: "HSC ২5 অনলাইন ব্যাচ (ফিজিক্স, কেমিস্ট্রি, ম্যাথ, বায়োলজি)",
    price: 6700,
    rating: 4.5,
    status: "New",
    sold: 1200,
    category: "১০ম শ্রেণী",
    courseDetails: [
      {
        id: 1,
        title: "৫ টি বিষয়",
      },
      {
        id: 2,
        title: "৯০ টি লাইভ ক্লাস",
      },
      {
        id: 3,
        title: "৫ টি ফাইনাল মডেল টেস্ট",
      },
    ],
    tags: ["HSC", "ফিজিক্স", "কেমিস্ট্রি", "ম্যাথ", "বায়োলজি"],
    image_link:
      "https://img.freepik.com/free-psd/courses-home-landing-page-template_23-2149109787.jpg?w=900&t=st=1687370644~exp=1687371244~hmac=c2e518b9b4ceb9e644f208e45476a9c0eea8eea3174ed622a51f7d14d1d4b436",
  },
  {
    id: 2,
    title: "HSC ২5 অনলাইন ব্যাচ (ফিজিক্স, কেমিস্ট্রি, ম্যাথ, বায়োলজি)",
    price: 5700,
    rating: 4.5,
    status: "New",
    sold: 1200,
    category: "৮ম শ্রেণী",
    courseDetails: [
      {
        id: 1,
        title: "৫ টি বিষয়",
      },
      {
        id: 2,
        title: "৯০ টি লাইভ ক্লাস",
      },
      {
        id: 3,
        title: "৫ টি ফাইনাল মডেল টেস্ট",
      },
    ],
    tags: ["HSC", "ফিজিক্স", "কেমিস্ট্রি", "ম্যাথ", "বায়োলজি"],
    image_link:
      "https://img.freepik.com/free-psd/courses-home-landing-page-template_23-2149109787.jpg?w=900&t=st=1687370644~exp=1687371244~hmac=c2e518b9b4ceb9e644f208e45476a9c0eea8eea3174ed622a51f7d14d1d4b436",
  },
  {
    id: 3,
    title: "HSC ২5 অনলাইন ব্যাচ (ফিজিক্স, কেমিস্ট্রি, ম্যাথ, বায়োলজি)",
    price: 4900,
    rating: 4.5,
    status: "New",
    sold: 1200,
    category: "৯ম শ্রেণী",
    courseDetails: [
      {
        id: 1,
        title: "৫ টি বিষয়",
      },
      {
        id: 2,
        title: "৯০ টি লাইভ ক্লাস",
      },
      {
        id: 3,
        title: "৫ টি ফাইনাল মডেল টেস্ট",
      },
    ],
    tags: ["HSC", "ফিজিক্স", "কেমিস্ট্রি", "ম্যাথ", "বায়োলজি"],
    image_link:
      "https://img.freepik.com/free-psd/courses-home-landing-page-template_23-2149109787.jpg?w=900&t=st=1687370644~exp=1687371244~hmac=c2e518b9b4ceb9e644f208e45476a9c0eea8eea3174ed622a51f7d14d1d4b436",
  },
];

export const relatedCoursesStaticData = {
  title: "Related Courses",
  button1: "কোর্সটি কিনুন",
  button2: "বিস্তারিত দেখুন",
};

export const couseClassRoutineData = {
  title: "কোর্সের ক্লাস রুটিন",
  description:
    "প্রতিদিন ২ টি করে সপ্তাহে ১২ টি ক্লাস এবং শুক্রবার সাপ্তাহিক ছুটি ",
  classRoutine: [
    {
      id: 1,
      day: "শনিবার",
      classCount: "২ দুটি ক্লাস",
    },
    {
      id: 2,
      day: "রবিবার",
      classCount: "২ দুটি ক্লাস",
    },
    {
      id: 3,
      day: "সোমবার",
      classCount: "২ দুটি ক্লাস",
    },
    {
      id: 4,
      day: "মঙ্গলবার",
      classCount: "২ দুটি ক্লাস",
    },
    {
      id: 5,
      day: "বুধবার",
      classCount: "২ দুটি ক্লাস",
    },
    {
      id: 6,
      day: "বৃহস্পতিবার",
      classCount: "২ দুটি ক্লাস",
    },
  ],
};

export const courseDetailsData = [
  {
    id: 1,
    title: "HSC 2025 অনলাইন ব্যাচ কোর্স সম্পর্কে:",
    content:
      "HSC বিজ্ঞান বিভাগের ৪ টি বিষয়ের (পদার্থবিজ্ঞান, রসায়ন, জীববিজ্ঞান এবং উচ্চতর গণিত) সিলেবাস এমন ভাবে শেষ করা হবে এই কোর্সে যেখানে বেসিক থেকে শুরু করে প্রব্লেম সল্ভিং-সহ প্রতিটি খুঁটিনাটি বিষয় শেষ করা হবে যা HSC শিক্ষার্থীদের প্রতিটি বিষয়ে করে তুলবে পারদর্শী। যা নিশ্চিত করবে তাদের HSC পরীক্ষায় ভালো ফলাফল এবং তার সাথে এডমিশনের বেসিক প্রস্তুতির জন্য তৈরি করবে শিক্ষার্থীদের। তাই, HSC’র শুরুতেই বিজ্ঞান বিভাগের ক্যালেন্ডার গুছিয়ে প্রথম ও দ্বিতীয় পত্রের সিলেবাসের ১০০ তে ১০০ প্রস্তুতি নিশ্চিত করতে টেন মিনিট স্কুল নিয়ে এলো HSC 2025 অনলাইন ব্যাচ। ",
  },
  {
    id: 2,
    title: "'HSC 2025 অনলাইন ব্যাচ' যেই দিকগুলো বিশেষভাবে বিবেচনা করা হয়েছে:",
    content:
      "পুর্নবিন্যাসকৃত অথবা ফুল সিলেবাস যেভাবেই হোক তোমাদের বোর্ড পরীক্ষা, পিছিয়ে থাকবে না তোমাদের প্রিপারেশন! যে চ্যাপ্টারগুলো বেশি গুরুত্বপূর্ন সেইগুলো দিয়েই শুরু হচ্ছে তোমাদের ক্লাস। সরকার থেকে সিলেবাস পরিবর্তন সংক্রান্ত কোনো সিদ্ধান্ত আসলেই সেই অনুযায়ী তোমাদের কোর্স কারিকুলাম আপডেট করা হবে।পুর্নবিন্যাসকৃত অথবা ফুল সিলেবাস যেভাবেই হোক তোমাদের বোর্ড পরীক্ষা, পিছিয়ে থাকবে না তোমাদের প্রিপারেশন! যে চ্যাপ্টারগুলো বেশি গুরুত্বপূর্ন সেইগুলো দিয়েই শুরু হচ্ছে তোমাদের ক্লাস। সরকার থেকে সিলেবাস পরিবর্তন সংক্রান্ত কোনো সিদ্ধান্ত আসলেই সেই অনুযায়ী তোমাদের কোর্স কারিকুলাম আপডেট করা হবে।",
  },
  {
    id: 3,
    title: "'HSC 2025 অনলাইন ব্যাচ' যেই দিকগুলো বিশেষভাবে বিবেচনা করা হয়েছে:",
    content:
      "পুর্নবিন্যাসকৃত অথবা ফুল সিলেবাস যেভাবেই হোক তোমাদের বোর্ড পরীক্ষা, পিছিয়ে থাকবে না তোমাদের প্রিপারেশন! যে চ্যাপ্টারগুলো বেশি গুরুত্বপূর্ন সেইগুলো দিয়েই শুরু হচ্ছে তোমাদের ক্লাস। সরকার থেকে সিলেবাস পরিবর্তন সংক্রান্ত কোনো সিদ্ধান্ত আসলেই সেই অনুযায়ী তোমাদের কোর্স কারিকুলাম আপডেট করা হবে।পুর্নবিন্যাসকৃত অথবা ফুল সিলেবাস যেভাবেই হোক তোমাদের বোর্ড পরীক্ষা, পিছিয়ে থাকবে না তোমাদের প্রিপারেশন! যে চ্যাপ্টারগুলো বেশি গুরুত্বপূর্ন সেইগুলো দিয়েই শুরু হচ্ছে তোমাদের ক্লাস। সরকার থেকে সিলেবাস পরিবর্তন সংক্রান্ত কোনো সিদ্ধান্ত আসলেই সেই অনুযায়ী তোমাদের কোর্স কারিকুলাম আপডেট করা হবে।",
  },
  {
    id: 4,
    title: "'HSC 2025 অনলাইন ব্যাচ' যেই দিকগুলো বিশেষভাবে বিবেচনা করা হয়েছে:",
    content:
      "পুর্নবিন্যাসকৃত অথবা ফুল সিলেবাস যেভাবেই হোক তোমাদের বোর্ড পরীক্ষা, পিছিয়ে থাকবে না তোমাদের প্রিপারেশন! যে চ্যাপ্টারগুলো বেশি গুরুত্বপূর্ন সেইগুলো দিয়েই শুরু হচ্ছে তোমাদের ক্লাস। সরকার থেকে সিলেবাস পরিবর্তন সংক্রান্ত কোনো সিদ্ধান্ত আসলেই সেই অনুযায়ী তোমাদের কোর্স কারিকুলাম আপডেট করা হবে।পুর্নবিন্যাসকৃত অথবা ফুল সিলেবাস যেভাবেই হোক তোমাদের বোর্ড পরীক্ষা, পিছিয়ে থাকবে না তোমাদের প্রিপারেশন! যে চ্যাপ্টারগুলো বেশি গুরুত্বপূর্ন সেইগুলো দিয়েই শুরু হচ্ছে তোমাদের ক্লাস। সরকার থেকে সিলেবাস পরিবর্তন সংক্রান্ত কোনো সিদ্ধান্ত আসলেই সেই অনুযায়ী তোমাদের কোর্স কারিকুলাম আপডেট করা হবে।",
  },
];

export const courseDetailsStaticData = {
  title: "কোর্স সম্পর্কে বিস্তারিত",
};
