export const courseAccessData = {
  quiz_status: "কুইজ আছে", // কুইজ আছে, কুইজ নেই, কুইজ দিয়েছেন
  classroom_link: "https://www.google.com",
  assignment_status: " এসাইনমেন্ট নেই", // এসাইনমেন্ট আছে, এসাইনমেন্ট নেই, এসাইনমেন্ট দিয়েছেন
  recorded_video_link: "https://www.google.com",
};

export const courseAccessStaticData = {
  record_video_button: "রেকর্ডেড ভিডিও",
};

export const moduleListsData = [
  {
    id: 1,
    title: "অধ্যায়-১: সংখ্যা ও সংখ্যা ব্যবস্থা",
    contents: [
      {
        id: 1,
        title: "গুণনীয়ক,গুণিতক,গ.সা.গু",
      },
      {
        id: 2,
        title: "গ.সা.গু",
      },
      {
        id: 3,
        title: "ল.সা.গু",
      },
      {
        id: 4,
        title: "গ.সা.গু",
      },
    ],
  },
  {
    id: 2,
    title: "অধ্যায়-2: মৌলিক উৎপাদকের গাছ",
    contents: [
      {
        id: 1,
        title: "গুণনীয়ক,গুণিতক,গ.সা.গু",
      },
      {
        id: 2,
        title: "গ.সা.গু",
      },
      {
        id: 3,
        title: "ল.সা.গু",
      },
    ],
  },
];

export const tabs = [
  {
    id: 1,
    label: "ভিডিও ডেসক্রিপশন",
    videoDescription: ` <div className="text-justify">
    <h1 className="font-bold">৬ষ্ঠ শ্রেণি অনলাইন ব্যাচ ২০২৩</h1>
    <p>দেশের যেকোনো প্রান্ত থেকে ঘরে বসেই দেশসেরা শিক্ষকদের সাথে যুক্ত হও ইন্টারেক্টিভ লাইভ ক্লাসে, নাও ৬ষ্ঠ শ্রেণির সম্পূর্ণ সিলেবাসের 💯তে💯 প্রস্তুতি!</p>
    <p>ফুল সিলেবাস কোর্সে যা যা থাকছে</p>
    <p>
      প্রতি ক্লাসে ২ জন শিক্ষক পড়াবেন; একজন ক্লাস নিবেন, অন্যজন সমস্যার সমাধান দিবেন। লাইভ ক্লাসের ভেতরেই পরীক্ষা দেওয়ার এবং লিডারবোর্ড দেখার সুবিধা। প্রতি ক্লাস শেষেই পেয়ে যাবে সেই ক্লাসের লেকচার শিট এবং রেকর্ডেড ভার্সন। প্রতি সপ্তাহে বিষয়ভিত্তিক পরীক্ষা ও প্রোগ্রেস রিপোর্ট কার্ড। অনলাইন ক্লাসের টপিক নিয়ে যেকোনো জিজ্ঞাসা থাকলে তা সমাধানের জন্য ক্লাস শেষের ৩০ মিনিট পর্যন্ত দ্বিতীয় শিক্ষক থাকবেন। দেশের যেকোনো জায়গা দেশসেরা শিক্ষকদের কাছ থেকে অনলাইনে সর্বোচ্চ মানের পড়ালেখার সুযোগ।
    </p>
  </div>`,
    content: "",
  },
  {
    id: 2,
    label: "রেফারেন্স",
    referenceData: "লেসন প্ল্যান সম্পর্কিত গুরুত্বপূর্ণ লিংক এখানে দেওয়া হবে",
    content: "",
  },
  {
    id: 3,
    label: "কুইজ",
    quiz: {
      totalMarks: 10,
      obtainedMarks: 0,
    },
    content: "",
    quiz_attempted: true,
  },
  {
    id: 4,
    label: "অ্যাসাইনমেন্ট",
    assignmentDetails: {
      title: "অ্যাসাইনমেন্ট-১",
      lastSubmissionDate: "27 July 2023 11:59 PM",
      totalMarks: 100,
      obtainedMarks: 100,
      content: "",
      assignment_attempted: true,
      submitted_date: "26 July 2023 11:59 PM",
    },
    instructor_comments: {
      title: "কোর্স ইন্সট্রাকটরের মতামত",
      content:
        "কোর্স ইন্সট্রাক্টরের মতামত বক্তব্য অংশে আপনি শিক্ষা প্রতিষ্ঠানের বিভিন্ন ইন্সট্রাক্টরদের উপর ভিত্তি করে তাদের কোর্স বা ক্লাসের সামগ্রিক অভিজ্ঞতা এবং পেশাদার সফলতা বিষয়ে তাদের মতামত উল্লেখ করতে পারেন।",
    },

    requirements: {
      title: "অ্যাসাইনমেন্ট রিকুয়ারমেন্ট",
      content:
        "অ্যাসাইনমেন্টের শিরোনাম: অ্যাসাইনমেন্টের শিরোনাম লেখা থাকতে হবে। এটি আপনার অ্যাসাইনমেন্টের বিষয়বস্তুকে সংক্ষেপে উল্লেখ করতে সাহায্য করে।",
    },

    submit_methods: {
      title: "কিভাবে সাবমিট করবেন",
      content:
        "অ্যাসাইনমেন্ট সাবমিট করার আগে, আপনি নির্দিষ্ট সময় সীমা এবং অ্যাসাইনমেন্ট সাবমিট করার ফরম্যাট সম্পর্কে সুনিশ্চিত হতে পারেন।",
    },

    marks_policy: {
      title: "অ্যাসাইনমেন্ট মার্কস পলিসি",
      content:
        "অ্যাসাইনমেন্টের মার্কস প্রদান করার পদ্ধতি সাধারণভাবে প্রতিষ্ঠানের নীতিমালা অনুসারে ভিন্ন হতে পারে।",
    },
  },
];
