export const courseAccessData = {
  quiz_status: "কুইজ আছে", // কুইজ আছে, কুইজ নেই, কুইজ দিয়েছেন
  classroom_link: "https://www.google.com",
  assignment_status: " এসাইনমেন্ট নেই", // এসাইনমেন্ট আছে, এসাইনমেন্ট নেই, এসাইনমেন্ট দিয়েছেন
  recorded_video_link: "https://www.google.com",
};

export const courseAccessStaticData = {
  record_video_button: "রেকর্ডেড ভিডিও",
};

export const moduleListsData = [
  {
    id: 1,
    title: "অধ্যায়-১: সংখ্যা ও সংখ্যা ব্যবস্থা",
    contents: [
      {
        id: 1,
        title: "গুণনীয়ক,গুণিতক,গ.সা.গু",
      },
      {
        id: 2,
        title: "গ.সা.গু",
      },
      {
        id: 3,
        title: "ল.সা.গু",
      },
      {
        id: 4,
        title: "গ.সা.গু",
      },
    ],
  },
  {
    id: 2,
    title: "অধ্যায়-2: মৌলিক উৎপাদকের গাছ",
    contents: [
      {
        id: 1,
        title: "গুণনীয়ক,গুণিতক,গ.সা.গু",
      },
      {
        id: 2,
        title: "গ.সা.গু",
      },
      {
        id: 3,
        title: "ল.সা.গু",
      },
    ],
  },
];

export const tabs = [
  {
    id: 1,
    label: "ভিডিও ডেসক্রিপশন",
    content: ` <div className="text-justify">
    <h1 className="font-bold">৬ষ্ঠ শ্রেণি অনলাইন ব্যাচ ২০২৩</h1>
    <p>দেশের যেকোনো প্রান্ত থেকে ঘরে বসেই দেশসেরা শিক্ষকদের সাথে যুক্ত হও ইন্টারেক্টিভ লাইভ ক্লাসে, নাও ৬ষ্ঠ শ্রেণির সম্পূর্ণ সিলেবাসের 💯তে💯 প্রস্তুতি!</p>
    <p>ফুল সিলেবাস কোর্সে যা যা থাকছে</p>
    <p>
      প্রতি ক্লাসে ২ জন শিক্ষক পড়াবেন; একজন ক্লাস নিবেন, অন্যজন সমস্যার সমাধান দিবেন। লাইভ ক্লাসের ভেতরেই পরীক্ষা দেওয়ার এবং লিডারবোর্ড দেখার সুবিধা। প্রতি ক্লাস শেষেই পেয়ে যাবে সেই ক্লাসের লেকচার শিট এবং রেকর্ডেড ভার্সন। প্রতি সপ্তাহে বিষয়ভিত্তিক পরীক্ষা ও প্রোগ্রেস রিপোর্ট কার্ড। অনলাইন ক্লাসের টপিক নিয়ে যেকোনো জিজ্ঞাসা থাকলে তা সমাধানের জন্য ক্লাস শেষের ৩০ মিনিট পর্যন্ত দ্বিতীয় শিক্ষক থাকবেন। দেশের যেকোনো জায়গা দেশসেরা শিক্ষকদের কাছ থেকে অনলাইনে সর্বোচ্চ মানের পড়ালেখার সুযোগ।
    </p>
  </div>`,
  },
  {
    id: 2,
    label: "রেফারেন্স",
    content: "This is the content of Tab 2.",
  },
  {
    id: 3,
    label: "কুইজ",
    content: "This is the content of Tab 3.",
  },
  {
    id: 4,
    label: "অ্যাসাইনমেন্ট",
    content: "This is the content of Tab 4.",
  },
];
